# Formulae
brew "chezmoi"
brew "starship"
brew "neovim"
brew "pnpm"
brew "nvm"
brew "zoxide"
brew "fzf"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "eza"
brew "bat"
brew "fd"
brew "ripgrep"
brew "lua-language-server"
brew "diff-so-fancy"

# Casks
cask "ghostty"
cask "zen"
cask "slack"
cask "zoom"
cask "1password"
cask "1password-cli"
cask "raycast"
cask "visual-studio-code"
cask "orbstack"
cask "zed"

# Fonts
cask "font-jetbrains-mono-nerd-font"
cask "font-geist-mono-nerd-font"
