brew "chezmoi"
cask "ghostty"
cask "zen"
brew "starship"
cask "1password"
cask "1password-cli"
cask "raycast"
cask "visual-studio-code"
brew "neovim"
brew "dockutil"
brew "duti"
cask "font-jetbrains-mono-nerd-font"
brew "pnpm"
brew "node"
cask "orbstack"
cask "slack"
cask "zoom"
brew "nvm"
